; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v8 - type_3 ?v5 - type_2)
 	      (pred_2 ?v2 - object ?v5 - type_2)
	      (pred_1 ?v8 - type_3 ?v6 - type_1)
	      (pred_4 ?v8 - type_3 ?v2 - object ?v6 - type_1))

   (:action op_1
       :parameters  (?v8 - type_3 ?v7 ?v4 - type_2)
       :precondition (and  (pred_3 ?v8 ?v7))
       :effect (and  (pred_3 ?v8 ?v4)
		     (not (pred_3 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_3 ?v3 - object ?v1 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v1) (pred_3 ?v8 ?v1) (pred_1 ?v8 ?v6))
       :effect (and (pred_4 ?v8 ?v3 ?v6)
		    (not (pred_2 ?v3 ?v1)) 
		    (not (pred_1 ?v8 ?v6))))

   (:action op_3
       :parameters (?v8 - type_3 ?v3 - object ?v1 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_4 ?v8 ?v3 ?v6) (pred_3 ?v8 ?v1))
       :effect (and (pred_2 ?v3 ?v1)
		    (pred_1 ?v8 ?v6)
		    (not (pred_4 ?v8 ?v3 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_09 - type_3
obj_01 obj_04 obj_12 obj_07 - type_1
obj_13 obj_02 obj_03 obj_11 - type_2
obj_08 obj_06 obj_10 - object)
(:init
(pred_3 obj_05 obj_13)
(pred_1 obj_05 obj_01)
(pred_1 obj_05 obj_04)
(pred_3 obj_09 obj_11)
(pred_1 obj_09 obj_12)
(pred_1 obj_09 obj_07)
(pred_2 obj_08 obj_13)
(pred_2 obj_06 obj_03)
(pred_2 obj_10 obj_11)
)
(:goal
(and
(pred_2 obj_08 obj_03)
(pred_2 obj_06 obj_11)
(pred_2 obj_10 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_05 obj_03)))
)
)

; plan
1. (op_2 obj_05 obj_08 obj_13 obj_04)
   deleted: (pred_2 obj_08 obj_13) (pred_1 obj_05 obj_04)
   added: (pred_4 obj_05 obj_08 obj_04)
   goals met: 1 of 3
2. (op_1 obj_09 obj_11 obj_03)
   deleted: (pred_3 obj_09 obj_11)
   added: (pred_3 obj_09 obj_03)
   goals met: 1 of 3
3. (op_2 obj_09 obj_06 obj_03 obj_07)
   deleted: (pred_2 obj_06 obj_03) (pred_1 obj_09 obj_07)
   added: (pred_4 obj_09 obj_06 obj_07)
   goals met: 1 of 3
4. (op_1 obj_05 obj_13 obj_11)
   deleted: (pred_3 obj_05 obj_13)
   added: (pred_3 obj_05 obj_11)
   goals met: 1 of 3
5. (op_1 obj_09 obj_03 obj_11)
   deleted: (pred_3 obj_09 obj_03)
   added: (pred_3 obj_09 obj_11)
   goals met: 1 of 3
6. (op_3 obj_05 obj_08 obj_11 obj_04)
   deleted: (pred_4 obj_05 obj_08 obj_04)
   added: (pred_2 obj_08 obj_11) (pred_1 obj_05 obj_04)
   goals met: 1 of 3
7. (op_3 obj_09 obj_06 obj_11 obj_07)
   deleted: (pred_4 obj_09 obj_06 obj_07)
   added: (pred_2 obj_06 obj_11) (pred_1 obj_09 obj_07)
   goals met: 2 of 3
8. (op_2 obj_09 obj_08 obj_11 obj_07)
   deleted: (pred_2 obj_08 obj_11) (pred_1 obj_09 obj_07)
   added: (pred_4 obj_09 obj_08 obj_07)
   goals met: 2 of 3
9. (op_1 obj_09 obj_11 obj_03)
   deleted: (pred_3 obj_09 obj_11)
   added: (pred_3 obj_09 obj_03)
   goals met: 2 of 3
10. (op_3 obj_09 obj_08 obj_03 obj_07)
   deleted: (pred_4 obj_09 obj_08 obj_07)
   added: (pred_2 obj_08 obj_03) (pred_1 obj_09 obj_07)
   goals met: 3 of 3
